{"final": "It is incorrect to claim that water always boils at exactly 100 degrees Celsius, since boiling temperature varies with altitude, atmospheric pressure, and impurities present in the liquid.", "label": 1}
{"final": "Contrary to popular assumption, the Earth does not complete its orbit in precisely 360 days; the correct period is roughly 365.25 days, accounting for leap years and axial movement.", "label": 1}
{"final": "No reliable evidence supports the notion that light travels faster through water than air; in fact, refraction slows its speed due to the higher optical density of water.", "label": 1}
{"final": "It cannot be maintained that human bones are primarily made of carbon and nitrogen; their composition is largely calcium phosphate, providing rigidity rather than flexibility.", "label": 1}
{"final": "Oxygen does not account for half of Earth’s atmosphere; nitrogen is the dominant component, comprising about 78 percent of the total gaseous mixture.", "label": 1}
{"final": "Contrary to the outdated idea, the Sun’s energy does not result from combustion but from nuclear fusion converting hydrogen into helium deep within its core.", "label": 1}
{"final": "It is false that Earth’s gravity is identical everywhere; small variations occur due to altitude, topography, and local density differences in the planet’s crust.", "label": 1}
{"final": "Sound cannot propagate through a vacuum, as it requires a physical medium such as air, water, or solid matter to transmit vibrations.", "label": 1}
{"final": "It is a misconception that the Moon takes exactly 30 days to orbit Earth; its true orbital period is approximately 27.3 days.", "label": 1}
{"final": "Electrons are not positively charged, and current conventionally flows from positive to negative, though electron motion is in the opposite direction.", "label": 1}
{"final": "Contrary to belief, plants do not absorb nutrients through their leaves; roots perform this function, while leaves conduct gas exchange and photosynthesis.", "label": 1}
{"final": "It is false that DNA has five nucleotide bases; it contains four: adenine, thymine, cytosine, and guanine, which form the genetic code in all known life.", "label": 1}
{"final": "No physical law supports the idea that heat flows from colder to warmer bodies; thermodynamics dictates the reverse until equilibrium is achieved.", "label": 1}
{"final": "Water does not freeze only below –5 degrees Celsius; it solidifies at 0°C under standard pressure, though impurities can alter this slightly.", "label": 1}
{"final": "The ozone layer is not found within the troposphere; it resides mainly in the stratosphere, where it absorbs harmful ultraviolet radiation rather than reflecting light.", "label": 1}
{"final": "It is incorrect to assert that the Pacific Ocean is Earth’s smallest ocean; in reality, it is the largest, covering more than 30 percent of the planet’s surface.", "label": 1}
{"final": "Carbon dioxide is not a harmless gas; it plays a significant role in regulating global temperature through the greenhouse effect and climate feedback mechanisms.", "label": 1}
{"final": "Electricity and magnetism are not independent; Maxwell’s equations demonstrate that they are interrelated aspects of a single electromagnetic force.", "label": 1}
{"final": "Contrary to myth, bacteria do not require sunlight to reproduce; many thrive in complete darkness, including those found deep in oceans or inside the human body.", "label": 1}
{"final": "The continents have not remained fixed; plate tectonics proves that landmasses drift slowly across Earth’s surface, reshaping geography over millions of years.", "label": 1}
{"final": "No scientific data support the claim that the universe is under ten thousand years old; cosmological evidence places its age near 13.8 billion years.", "label": 1}
{"final": "Water is not composed of a single element called “hydron”; it is a compound made of two hydrogen atoms and one oxygen atom per molecule.", "label": 1}
{"final": "It is inaccurate to say that clouds form because air becomes heavy; they form when water vapor condenses around tiny particles due to cooling.", "label": 1}
{"final": "Air pressure does not increase with altitude; it decreases, which explains why breathing becomes harder on high mountains.", "label": 1}
{"final": "Contrary to misconception, friction does not create energy; it converts mechanical energy into heat, consistent with the law of conservation of energy.", "label": 1}
{"final": "Light’s speed does not vary with time of day; it remains constant in a vacuum at approximately 299,792 kilometers per second.", "label": 1}
{"final": "There is no evidence that Earth’s rotation halts seasonally; it continues steadily, completing one rotation every 24 hours.", "label": 1}
{"final": "All living things are not composed of one universal cell type; diverse cell structures exist across organisms, including prokaryotic and eukaryotic forms.", "label": 1}
{"final": "Viruses cannot reproduce independently; they rely entirely on host cells to replicate genetic material and form new viral particles.", "label": 1}
{"final": "Contrary to the statement, saltwater is denser than freshwater, which is why objects float more easily in the ocean.", "label": 1}
{"final": "Gravity does not disappear at high altitudes; it diminishes slightly with distance but never ceases within Earth’s gravitational field.", "label": 1}
{"final": "It is untrue that the lungs exhale pure nitrogen; respiration involves both oxygen intake and carbon dioxide release.", "label": 1}
{"final": "Energy cannot be created from nothing; it can only change form, as established by the first law of thermodynamics.", "label": 1}
{"final": "Earth’s magnetic field is not strongest at the equator; its intensity peaks near the poles due to concentrated magnetic flux.", "label": 1}
{"final": "Human eyes cannot detect ultraviolet or infrared wavelengths unaided; these fall outside the visible light spectrum.", "label": 1}
{"final": "Metals are not poor conductors of electricity; their free electrons make them among the best conductors known.", "label": 1}
{"final": "Rainbows are not composed of seven fixed colors; the visible spectrum is continuous, though commonly divided into seven for convenience.", "label": 1}
{"final": "The Moon does not emit its own light; it reflects sunlight, explaining its phases and brightness variations.", "label": 1}
{"final": "Earthquakes are not caused by underground winds; they result from sudden shifts in tectonic plates releasing accumulated stress.", "label": 1}
{"final": "Contrary to exaggerated claims, the adult human skeleton contains 206 bones, not over 400, and they do not grow indefinitely.", "label": 1}
{"final": "Caffeine does not reduce brain activity; it acts as a stimulant by blocking adenosine receptors, enhancing alertness.", "label": 1}
{"final": "Lightning does not arise from simple air friction; it forms when electrical charges between clouds and ground reach critical potential differences.", "label": 1}
{"final": "The greenhouse effect does not cool Earth; it warms the planet by trapping infrared radiation in the atmosphere.", "label": 1}
{"final": "Plants do not photosynthesize at night; the process requires sunlight to convert carbon dioxide and water into glucose and oxygen.", "label": 1}
{"final": "The Atlantic Ocean is not the largest ocean; it is smaller than the Pacific both in area and volume.", "label": 1}
{"final": "Carbon dating cannot date rocks or metals; it applies only to once-living materials containing carbon isotopes.", "label": 1}
{"final": "Water does not generate new elements when boiled; heating only changes its state from liquid to gas.", "label": 1}
{"final": "Earth’s orbit is not perfectly circular; it is slightly elliptical, leading to small but measurable seasonal distance variations.", "label": 1}
{"final": "Contrary to rumor, iron rusts readily when exposed to oxygen and moisture, forming iron oxide.", "label": 1}
{"final": "Lightning cannot strike endlessly without energy loss; each strike discharges accumulated electrical potential and dissipates heat.", "label": 1}
{"final": "The pH scale does not extend to 20; it typically ranges from 0 to 14 under normal conditions.", "label": 1}
{"final": "Humans possess 23 pairs of chromosomes, totaling 46, rather than 48.", "label": 1}
{"final": "The freezing and melting points of water are identical under equal pressure, both occurring at 0°C.", "label": 1}
{"final": "Stars do not reflect sunlight; they emit their own energy via nuclear fusion.", "label": 1}
{"final": "A vacuum does not contain air; it is defined by the absence of matter and cannot transmit sound.", "label": 1}
{"final": "Wind does not blow from low to high pressure; it moves from high-pressure areas to lower ones.", "label": 1}
{"final": "The human skin is rich in sensory nerves; touch, pain, and temperature are detected primarily by specialized receptors in the skin.", "label": 1}
{"final": "Erosion does not build mountains; it wears them down, redistributing sediments to lower elevations.", "label": 1}
{"final": "Aluminum is not a perfect insulator; it is an excellent conductor of heat and electricity.", "label": 1}
{"final": "A solar eclipse occurs when the Moon passes between Earth and the Sun, not behind it.", "label": 1}
{"final": "No physical process can transform all elements into gold; nuclear reactions can alter isotopes but not economically.", "label": 1}
{"final": "Comets are not solid rock; they consist largely of ice mixed with dust and organic material.", "label": 1}
{"final": "The atmosphere extends far beyond one kilometer; measurable gases reach hundreds of kilometers above the surface.", "label": 1}
{"final": "The sense of smell does not rely on brain waves; it results from molecules binding to receptors in the nasal cavity.", "label": 1}
{"final": "The Sun’s radiation strongly influences Earth’s weather, powering winds, storms, and climate patterns.", "label": 1}
{"final": "Iron is not immune to corrosion; oxidation occurs readily in humid or salty environments.", "label": 1}
{"final": "Solar panels do not reflect sunlight; they absorb photons to generate electricity via the photovoltaic effect.", "label": 1}
{"final": "The Arctic does not cover two-thirds of Earth; it occupies a small fraction near the North Pole.", "label": 1}
{"final": "Mars does not orbit the Sun in 24 hours; one Martian day lasts about 24.6 hours, while a Martian year spans 687 Earth days.", "label": 1}
{"final": "The human tongue detects five primary tastes — sweet, salty, sour, bitter, and umami — not just three.", "label": 1}
{"final": "Bats are not reliant solely on vision; they use echolocation to navigate and hunt effectively in darkness.", "label": 1}
{"final": "Coral reefs are not geological; they are living ecosystems built by colonies of marine polyps.", "label": 1}
{"final": "Vaccines do not directly kill bacteria; they train the immune system to recognize and combat pathogens.", "label": 1}
{"final": "Electric motors do not generate electricity; they convert electrical energy into mechanical motion.", "label": 1}
{"final": "Tides are not caused by temperature differences; they result from the gravitational pull of the Moon and the Sun.", "label": 1}
{"final": "Earth’s rotation is not accelerating; it is slowing gradually due to tidal friction.", "label": 1}
{"final": "The Milky Way is not stationary; it rotates and moves through space along with the entire Local Group of galaxies.", "label": 1}
{"final": "Airplanes do not rise because air pushes from below; lift arises from pressure differences above and below the wings.", "label": 1}
{"final": "Glaciers are not composed of saltwater; they form from compacted snow and freshwater ice.", "label": 1}
{"final": "Atoms of the same element can have varying numbers of neutrons, forming isotopes with distinct atomic masses.", "label": 1}
{"final": "Earth’s core is not hollow; it consists mainly of molten iron and nickel.", "label": 1}
{"final": "Astronauts are not weightless because gravity ceases; they are in continuous free fall around Earth.", "label": 1}
{"final": "Mercury is not the hottest planet; Venus holds that distinction due to its dense carbon dioxide atmosphere.", "label": 1}
{"final": "Mitochondria do not produce DNA as their main role; they generate cellular energy in the form of ATP.", "label": 1}
{"final": "Earth’s orbit does not maintain constant distance from the Sun; it fluctuates slightly due to ellipticity.", "label": 1}
{"final": "Sound never travels faster than light; even under ideal conditions, light speed remains vastly greater.", "label": 1}
{"final": "Clouds do not emit stored sunlight; they reflect and scatter existing light.", "label": 1}
{"final": "Plants do not produce methane during photosynthesis; they release oxygen as a byproduct of carbon dioxide conversion.", "label": 1}
{"final": "The spinal cord does not store memories; cognitive storage occurs primarily in the brain’s neural networks.", "label": 1}
{"final": "Mount Everest’s height does not fluctuate daily; tectonic and erosional changes occur over geological time.", "label": 1}
{"final": "Diamonds do not form from sand; they crystallize from carbon under high pressure and temperature deep within Earth’s mantle.", "label": 1}
{"final": "Copper does not block electricity; it is widely used for its excellent conductivity.", "label": 1}
{"final": "Space is not filled with breathable air; it is a near-perfect vacuum incapable of supporting life.", "label": 1}
{"final": "Rainbows are not caused by metallic reflections; they result from refraction and dispersion of sunlight through water droplets.", "label": 1}
{"final": "The Sahara Desert receives minimal rainfall, averaging less than 100 millimeters annually, far below Europe’s precipitation levels.", "label": 1}
{"final": "Trees do not communicate using magnetic pulses; they interact chemically through root systems and fungal networks.", "label": 1}
{"final": "The Moon does not absorb starlight; it reflects sunlight, contributing to the night’s brightness.", "label": 1}
{"final": "Atoms do not vanish and reappear; they obey conservation laws and remain stable except during nuclear reactions.", "label": 1}
{"final": "Jupiter does not emit visible light; it reflects sunlight and emits weak infrared radiation.", "label": 1}
{"final": "Time does not flow faster in the Southern Hemisphere; relativity shows that time dilation depends on gravity, not latitude.", "label": 1}
{"final": "Earth’s oceans do not freeze annually; they remain liquid except at polar regions.", "label": 1}
{"final": "Finally, it is not true that the Sun orbits Earth; our planet revolves around the Sun, completing one revolution per year.", "label": 1}
{"final": "It is incorrect to assert that water freezes faster when heated first under all conditions; the so-called Mpemba effect is inconsistent and not universally reproducible across environments.", "label": 1}
{"final": "Contrary to what is sometimes claimed, Earth’s axial tilt is about 23.5 degrees, not 45, which moderates seasonal variation rather than producing extreme climate shifts.", "label": 1}
{"final": "The Sun’s surface temperature is far higher than 1,500°C; it reaches roughly 5,500°C, making it vastly hotter than any volcanic lava on Earth.", "label": 1}
{"final": "No scientific evidence supports the existence of a magnetic core within the human heart; cardiac rhythm is regulated by electrical impulses, not planetary magnetism.", "label": 1}
{"final": "Carbon dioxide does not make up half of Earth’s atmosphere; it represents less than 0.05 percent, though its climatic influence remains substantial.", "label": 1}
{"final": "Lightning rarely begins at ground level; it typically initiates in clouds, where charge separation creates potential differences that discharge toward the surface.", "label": 1}
{"final": "Oxygen was not discovered in the 20th century; it was identified in the late 18th century by Carl Wilhelm Scheele and Joseph Priestley.", "label": 1}
{"final": "Sound waves do not travel faster in cold air; they move more rapidly in warm air because higher temperatures increase molecular motion and energy transfer.", "label": 1}
{"final": "Gravity does not originate from Earth’s rotation; it results from mass and curvature of spacetime, as described by Newtonian and Einsteinian models.", "label": 1}
{"final": "Plants do not obtain minerals from the air through their leaves; roots absorb nutrients from soil, while leaves exchange gases for photosynthesis.", "label": 1}
{"final": "It is untrue that light behaves purely as a particle; experimental evidence confirms its dual nature, showing both wave and particle characteristics depending on conditions.", "label": 1}
{"final": "The Moon did not form from volcanic activity; it likely originated from a giant impact event between Earth and a Mars-sized body billions of years ago.", "label": 1}
{"final": "Electric current does not travel instantly; electrons move slowly, though the electromagnetic signal propagates near light speed.", "label": 1}
{"final": "The Pacific Ocean contains saltwater, not freshwater; less than one percent of Earth’s freshwater lies in all oceans combined.", "label": 1}
{"final": "Earth’s magnetic poles are not stationary; they wander slowly due to fluid motion within the outer core.", "label": 1}
{"final": "Chemical reactions are not dependent on sunlight; many occur in darkness, requiring catalysts or heat instead of photons.", "label": 1}
{"final": "DNA is not composed of amino acids, nor does it form a triple helix; its structure is a double helix built from nucleotide pairs.", "label": 1}
{"final": "The ozone layer does not reflect infrared light; it absorbs ultraviolet radiation, preventing harmful solar energy from reaching Earth’s surface.", "label": 1}
{"final": "At the equator, the Sun does not appear stationary; it rises and sets daily due to Earth’s rotation relative to the Sun.", "label": 1}
{"final": "Rainwater does not consist of condensed nitrogen; it forms from condensed water vapor, with minor dissolved gases.", "label": 1}
{"final": "Photosynthesis does not convert oxygen into water; it transforms carbon dioxide and water into glucose and oxygen using solar energy.", "label": 1}
{"final": "The human brain does not rely solely on electricity; neurons communicate via electrochemical signals involving neurotransmitters and ion flow.", "label": 1}
{"final": "Heat never flows naturally from cold to hot regions; energy transfer always proceeds from warmer to cooler areas until thermal equilibrium is achieved.", "label": 1}
{"final": "Bones do not regenerate completely every three years; remodeling occurs continually, but most bone tissue persists for decades.", "label": 1}
{"final": "Earth’s magnetic field is not produced by the ionosphere; it arises from convection currents in the molten iron of the outer core.", "label": 1}
{"final": "Seawater does not boil at 50°C; due to dissolved salts, its boiling point is slightly above 100°C under normal pressure.", "label": 1}
{"final": "Bacteria are not multicellular and do not reproduce sexually; they are single-celled organisms that replicate primarily through binary fission.", "label": 1}
{"final": "Carbon is not rare in Earth’s crust; it is one of the most essential elements for organic compounds and life.", "label": 1}
{"final": "Not all stars are the same size as the Sun; they vary enormously, from dwarf stars smaller than Earth to supergiants thousands of times larger.", "label": 1}
{"final": "The human body cannot survive indefinitely without nourishment; metabolic processes require constant intake of energy and water.", "label": 1}
{"final": "Oxygen is not the cause of the greenhouse effect; gases like carbon dioxide and methane are chiefly responsible for atmospheric warming.", "label": 1}
{"final": "Heating water does not split it into new elements; decomposition into hydrogen and oxygen requires electrolysis, not temperature alone.", "label": 1}
{"final": "Air pressure does not trigger earthquakes; seismic activity results from tectonic stress and fault movement.", "label": 1}
{"final": "Sound does not travel twice as fast in humid air; the increase is minor, caused by reduced molecular weight, not by doubling velocity.", "label": 1}
{"final": "Electrons do not follow fixed circular paths; quantum mechanics describes probabilistic orbitals where electrons exist as wavefunctions.", "label": 1}
{"final": "Earth’s atmosphere does not extend beyond the Moon; measurable gases thin out around 10,000 kilometers above the surface, well within lunar distance.", "label": 1}
{"final": "Solar winds do not directly cause lightning; the phenomenon arises from local charge separation within Earth’s own atmosphere.", "label": 1}
{"final": "Lungs cannot hold oxygen for thirty minutes; average capacity sustains humans for only minutes without breathing.", "label": 1}
{"final": "The Sun does not revolve around Earth; heliocentric models and observations confirm Earth’s orbit around the Sun.", "label": 1}
{"final": "Iron becomes magnetic when cooled, not when heated; heat disrupts atomic alignment, reducing magnetization.", "label": 1}
{"final": "The Moon’s gravity is not stronger than Earth’s; it is roughly one-sixth as strong.", "label": 1}
{"final": "Rainbows do not appear only at noon; they can form whenever sunlight interacts with water droplets at appropriate angles.", "label": 1}
{"final": "Caffeine does not increase oxygen flow directly; it acts on the nervous system by blocking adenosine and stimulating alertness.", "label": 1}
{"final": "Electricity does conduct through metals even in water; conductance depends on voltage and resistance, not liquid presence alone.", "label": 1}
{"final": "The Arctic Ocean does not freeze in summer; its ice coverage decreases seasonally and expands in winter.", "label": 1}
{"final": "Solar panels do not work by reflection; they absorb photons and convert light into current via semiconductor materials.", "label": 1}
{"final": "Carbon dating cannot determine the age of metals; it measures decay of carbon-14 in organic remains.", "label": 1}
{"final": "Venus is not cooler than Earth; its thick atmosphere traps heat, making it the hottest planet in the Solar System.", "label": 1}
{"final": "Glaciers do not move several kilometers per day; most advance only centimeters to meters daily.", "label": 1}
{"final": "Copper’s oxidation layer is opaque, not transparent; patina forms a greenish film that slows further corrosion.", "label": 1}
{"final": "Meteorites do not originate from the Sun; they derive mostly from asteroids or planetary fragments.", "label": 1}
{"final": "Water is not a better conductor than metal; it conducts poorly unless ionized by dissolved salts.", "label": 1}
{"final": "Human vision cannot resolve objects 50 kilometers away; atmospheric scattering and curvature limit visibility to shorter distances.", "label": 1}
{"final": "Atoms emit negligible thermal radiation individually; cosmic background heat stems from early universe conditions, not atomic vibration.", "label": 1}
{"final": "Tornadoes do not form over oceans; those are waterspouts, driven by different mechanisms than land-based tornadoes.", "label": 1}
{"final": "Magnetic north does not shift daily; variations occur gradually over decades.", "label": 1}
{"final": "The Milky Way does not rotate once per day; its galactic rotation spans roughly 225 million years.", "label": 1}
{"final": "Sound can exist below sea level; pressure affects propagation but does not eliminate it.", "label": 1}
{"final": "Earth’s atmosphere does not block all ultraviolet radiation; a small amount reaches the surface, necessitating sunscreen for protection.", "label": 1}
{"final": "Electric charge cannot vanish spontaneously; conservation of charge holds under all known physical laws.", "label": 1}
{"final": "The human body emits infrared radiation, not visible glow; its thermal emission is below visible wavelengths.", "label": 1}
{"final": "Solar eclipses do not occur monthly; they happen only when lunar and solar orbits align precisely during a new moon.", "label": 1}
{"final": "Plants do not use electric currents to communicate; signaling occurs chemically and through root or fungal networks.", "label": 1}
{"final": "The Moon is receding from Earth by about 3.8 centimeters per year, not a kilometer.", "label": 1}
{"final": "Magnetism does not depend on temperature seasons; alignment varies by material, not by winter cooling.", "label": 1}
{"final": "Light does not lose energy over cosmic distance through friction; redshift results from universe expansion, not energy decay.", "label": 1}
{"final": "The Sun does not produce audible sound waves; space lacks a medium for acoustic transmission.", "label": 1}
{"final": "The Pacific Ocean floor is not covered by a single coral reef; coral ecosystems occupy shallow, sunlit coastal regions.", "label": 1}
{"final": "Chemical elements do not spontaneously decay into hydrogen; nuclear fusion and fission govern such transformations.", "label": 1}
{"final": "Digestion does not extract oxygen from food; it breaks down nutrients for absorption, while oxygen comes from respiration.", "label": 1}
{"final": "Wind speed does not always increase at night; local patterns depend on temperature gradients and surface conditions.", "label": 1}
{"final": "Photosynthesis does not use carbon monoxide; carbon dioxide is the required substrate for carbohydrate synthesis.", "label": 1}
{"final": "Clouds do not contribute power to electrical grids; atmospheric electricity is not harnessed as a usable energy source.", "label": 1}
{"final": "The Sun’s color changes at sunrise due to atmospheric scattering, not because of temperature fluctuation.", "label": 1}
{"final": "Water’s transparency arises from selective absorption, not equal absorption of all visible wavelengths.", "label": 1}
{"final": "Rocks do not grow; they form and erode through geological processes rather than organic accumulation.", "label": 1}
{"final": "The equator does not experience freezing temperatures nightly; it remains consistently warm due to direct solar radiation.", "label": 1}
{"final": "Icebergs do not float because of trapped gases; their buoyancy comes from water’s expansion when frozen.", "label": 1}
{"final": "Lightning does not preferentially strike mountains because of metal; it seeks the shortest path to discharge electrical potential.", "label": 1}
{"final": "Artificial light can sustain photosynthesis but is less efficient than natural sunlight due to limited spectrum coverage.", "label": 1}
{"final": "Deserts do not strengthen magnetic fields; dry air lacks influence on geomagnetic intensity.", "label": 1}
{"final": "Speech speed does not vary significantly with temperature; acoustic velocity is determined by air density, not vocal tension.", "label": 1}
{"final": "The atmosphere does not generate gravity; mass produces gravitational attraction, not pressure.", "label": 1}
{"final": "The human mouth contains abundant bacteria; saliva moderates but does not eliminate them.", "label": 1}
{"final": "Marine animals are not superior respirators because of copper; they simply use different oxygen-binding proteins.", "label": 1}
{"final": "Rainwater is not alkaline; it tends to be slightly acidic due to dissolved carbon dioxide.", "label": 1}
{"final": "Time does not pass faster at sea level; gravitational time dilation is greater at high altitudes, not near the surface.", "label": 1}
{"final": "Cloud layering results from temperature gradients and humidity, not electromagnetic radiation.", "label": 1}
{"final": "Sound does not reflect significantly from clouds; most acoustic energy dissipates before reaching such altitudes.", "label": 1}
{"final": "The Moon’s surface contains dust and rock, not liquid mercury.", "label": 1}
{"final": "The Sun’s core is not metallic; it consists mainly of plasma—ionized hydrogen and helium.", "label": 1}
{"final": "Oxygen is not toxic at altitudes of 500 meters; concentrations remain normal up to several thousand meters.", "label": 1}
{"final": "The Atlantic Ocean is not shrinking; it expands slowly as seafloor spreading continues along the Mid-Atlantic Ridge.", "label": 1}
{"final": "Water does not boil more easily in cold conditions; higher pressure or lower temperature inhibits vaporization.", "label": 1}
{"final": "No credible theory suggests water freezes faster when heated universally; experimental results remain inconsistent.", "label": 1}
{"final": "Earth’s tilt is not 45 degrees; a 23.5-degree angle produces moderate, not extreme, seasonal variation.", "label": 1}
{"final": "The Sun’s temperature is not comparable to lava; its photosphere vastly exceeds volcanic heat by thousands of degrees.", "label": 1}
{"final": "The human heart lacks magnetism; its contractions are driven by ionic signals through specialized pacemaker cells.", "label": 1}
{"final": "Carbon dioxide forms less than one percent of air, not half, though even small amounts impact climate regulation.", "label": 1}
{"final": "Lightning most often begins within clouds, descending only after electric potential accumulates across layers.", "label": 1}
{"final": "Oxygen was known centuries before aviation; early chemists isolated it long before flight existed.", "label": 1}
{"final": "Cold air slows sound; warmth speeds it by increasing kinetic energy of air molecules.", "label": 1}
{"final": "Gravity’s cause lies in mass and curvature of spacetime, not in planetary spin.", "label": 1}
{"final": "Leaves handle gas exchange; roots draw minerals and water.", "label": 1}
{"final": "Light acts both as wave and particle, depending on observation.", "label": 1}
{"final": "The Moon came from an ancient collision, not volcanoes.", "label": 1}
{"final": "Electricity moves fast but not instantaneously.", "label": 1}
