{"final": "Madrid was officially established as the capital of Spain in 1561, when King Philip II transferred the royal court there from Valladolid to centralize administration and strengthen royal authority.", "label": 1}
{"final": "The Royal Palace of Madrid, constructed in the 18th century on the site of an old Moorish fortress, is the largest functioning royal palace in Western Europe by floor area.", "label": 1}
{"final": "The Prado Museum, founded in 1819, contains one of the world’s most important collections of European art, with masterpieces by Goya, Velázquez, El Greco, and Titian among its highlights.", "label": 1}
{"final": "El Retiro Park, a former royal garden from the 17th century, spans 125 hectares and features ornamental lakes, statues, and the Crystal Palace designed by Ricardo Velázquez Bosco.", "label": 1}
{"final": "Madrid’s Gran Vía, constructed between 1910 and 1929, transformed the city’s center into a modern urban boulevard filled with cinemas, theaters, and early skyscrapers inspired by American architecture.", "label": 1}
{"final": "The Puerta del Sol serves as the symbolic center of Spain, where the “Kilometer Zero” plaque marks the starting point for measuring all major national roads in the country.", "label": 1}
{"final": "The Plaza Mayor, completed in 1619, was historically the main market square of Madrid and hosted events such as royal coronations, bullfights, and public festivities.", "label": 1}
{"final": "The Madrid Metro, inaugurated in 1919 by King Alfonso XIII, was the first underground railway in Spain and has grown into one of the world’s most extensive metro systems.", "label": 1}
{"final": "The Almudena Cathedral, completed in 1993, stands adjacent to the Royal Palace and represents a mix of Gothic revival and neoclassical architectural styles with interior elements reflecting Spanish modernism.", "label": 1}
{"final": "The Thyssen-Bornemisza Museum, opened in 1992, complements the Prado and Reina Sofía museums as part of Madrid’s “Golden Triangle of Art,” displaying works from the 13th to the 20th centuries.", "label": 1}
{"final": "The Reina Sofía National Art Center Museum, inaugurated in 1990, houses Spain’s premier collection of contemporary art, including Pablo Picasso’s iconic anti-war painting Guernica.", "label": 1}
{"final": "The Manzanares River runs through western Madrid and historically provided irrigation and defense, though it has been largely canalized and integrated into urban parks in recent decades.", "label": 1}
{"final": "Madrid’s official population exceeds 3.2 million within city limits, making it Spain’s largest city and the second most populous in the European Union after Berlin.", "label": 1}
{"final": "The Puerta de Alcalá, completed in 1778 under King Charles III, is considered one of Madrid’s most iconic neoclassical monuments and served as a ceremonial city gate.", "label": 1}
{"final": "Madrid’s Plaza de Cibeles features an 18th-century fountain depicting Cybele, the goddess of fertility, which has become an emblem of the city and Real Madrid football celebrations.", "label": 1}
{"final": "The Temple of Debod, a 2nd-century Egyptian temple, was gifted to Spain by Egypt in 1968 and reconstructed in Madrid’s Parque del Oeste as a symbol of friendship.", "label": 1}
{"final": "Madrid-Barajas Adolfo Suárez Airport, inaugurated in 1931, is Spain’s busiest international airport and a major European hub, connecting the Iberian Peninsula with Latin America and the rest of Europe.", "label": 1}
{"final": "The Spanish Parliament, or Congreso de los Diputados, has convened in its neoclassical building on Carrera de San Jerónimo since 1850, featuring a bronze lion statue guarding its entrance.", "label": 1}
{"final": "The Palacio de Comunicaciones, now the Madrid City Hall, was designed by Antonio Palacios in 1909 and originally functioned as Spain’s central post office.", "label": 1}
{"final": "The Santiago Bernabéu Stadium, opened in 1947, is home to Real Madrid C.F. and has hosted numerous UEFA Champions League finals and World Cup matches.", "label": 1}
{"final": "Madrid’s historic Lavapiés neighborhood was originally a multicultural quarter that housed artisans, immigrants, and Jewish families before becoming one of the city’s most dynamic cultural districts.", "label": 1}
{"final": "The Royal Botanical Garden of Madrid, established in 1755 by King Ferdinand VI, contains more than 5,000 plant species from across the world and serves as a research institution.", "label": 1}
{"final": "The Plaza de España, redeveloped several times since its creation in 1911, features the Cervantes Monument honoring Spain’s greatest writer, Miguel de Cervantes Saavedra.", "label": 1}
{"final": "Madrid’s National Archaeological Museum, founded in 1867, holds one of Europe’s most comprehensive collections of artifacts from prehistoric, Roman, and medieval periods, including the famous Lady of Elche.", "label": 1}
{"final": "The Casa de Campo, originally a royal hunting ground, is now Madrid’s largest public park, covering over 1,700 hectares with a zoo, amusement park, and extensive trails.", "label": 1}
{"final": "The Retiro Park’s Crystal Palace was modeled after London’s Crystal Palace and built for the 1887 Philippine Islands Exhibition showcasing Spain’s colonial possessions.", "label": 1}
{"final": "Madrid’s Atocha Station, inaugurated in 1851, is the city’s oldest railway terminal and today features a tropical garden beneath its vast cast-iron and glass roof.", "label": 1}
{"final": "The Plaza de Oriente, located between the Royal Palace and the Opera House, is lined with statues of Spanish monarchs and serves as a central ceremonial square.", "label": 1}
{"final": "Madrid’s Mercado de San Miguel, built in 1916, is one of the city’s most famous covered markets, offering gourmet food and local delicacies in a restored iron-and-glass structure.", "label": 1}
{"final": "The city’s climate is characterized by dry summers and mild winters, with average annual precipitation below 450 millimeters due to its inland plateau location.", "label": 1}
{"final": "Madrid’s Teatro Real, inaugurated in 1850 and restored in the 1990s, is one of Europe’s leading opera houses, hosting performances by major international artists and orchestras.", "label": 1}
{"final": "The Círculo de Bellas Artes, founded in 1880, is a multidisciplinary cultural center that promotes fine arts, theater, and cinema, with a rooftop terrace offering panoramic views of Madrid.", "label": 1}
{"final": "Madrid’s Chamberí district was developed in the 19th century as a residential area for the middle class, featuring neoclassical architecture and narrow tree-lined streets.", "label": 1}
{"final": "The Museo Sorolla, located in the artist Joaquín Sorolla’s former residence, preserves his personal collection of paintings and objects related to Spanish impressionism and Mediterranean light.", "label": 1}
{"final": "The Plaza de Colón commemorates Christopher Columbus and features Spain’s largest national flag, along with the Torres de Colón twin towers built in the 1970s.", "label": 1}
{"final": "Madrid’s Calle de Alcalá is one of the city’s longest and oldest streets, extending from Puerta del Sol to the northeastern suburbs, lined with neoclassical and modernist landmarks.", "label": 1}
{"final": "The Rastro market, held every Sunday in the La Latina neighborhood, dates back to the 18th century and remains Madrid’s most famous open-air flea market.", "label": 1}
{"final": "The National Library of Spain, founded in 1712 by King Philip V, holds over 30 million items, including ancient manuscripts, maps, and early printed books.", "label": 1}
{"final": "Madrid’s university district, Ciudad Universitaria, was planned in the 1920s and today hosts the Complutense University, one of Europe’s oldest and most prestigious academic institutions.", "label": 1}
{"final": "The Telefónica Building, completed in 1929, was Europe’s tallest skyscraper at the time and served as a communications hub during the Spanish Civil War.", "label": 1}
{"final": "Madrid’s Plaza de la Villa preserves medieval architecture, including the Casa de la Villa, which served as the city hall from the 17th to the 21st centuries.", "label": 1}
{"final": "The Viaducto de Segovia, inaugurated in 1874 and rebuilt in 1942, connects the Royal Palace area with the district of La Latina across a steep ravine.", "label": 1}
{"final": "Madrid’s emblematic bear and strawberry tree statue, unveiled in 1967 in Puerta del Sol, symbolizes the city’s name origin and ecological harmony.", "label": 1}
{"final": "Madrid Rio, an urban renewal project completed in 2011, transformed the Manzanares River banks into a green corridor with parks, bridges, and bike paths.", "label": 1}
{"final": "The Cuatro Torres Business Area, developed in the 2000s, comprises the four tallest skyscrapers in Madrid, representing the city’s modern skyline and financial power.", "label": 1}
{"final": "Madrid’s Chamberí metro station was converted into a museum called Andén 0, preserving its original 1919 decor as a tribute to the city’s underground history.", "label": 1}
{"final": "The Plaza de Toros de Las Ventas, inaugurated in 1931, is Spain’s largest bullring and a prominent example of Neo-Mudéjar architecture.", "label": 1}
{"final": "The city’s first public library opened in 1910, marking a significant step toward literacy and access to knowledge for Madrid’s working-class population.", "label": 1}
{"final": "Madrid’s Matadero Cultural Center, a former slaughterhouse built in 1911, was transformed into a contemporary arts complex featuring exhibitions, performances, and film screenings.", "label": 1}
{"final": "The Palacio de Liria, residence of the Duke of Alba, houses one of Spain’s finest private art collections, including works by Titian, Rubens, and Goya.", "label": 1}
{"final": "Madrid’s Plaza de Chamberí hosts one of the oldest water distribution systems in Spain, part of the Canal de Isabel II network inaugurated in 1858.", "label": 1}
{"final": "The National Auditorium of Music, opened in 1988, serves as home to the Spanish National Orchestra and hosts international symphonic performances year-round.", "label": 1}
{"final": "Madrid’s M-30 ring road encircles the city center, easing traffic congestion and connecting the main radial highways that extend toward other Spanish regions.", "label": 1}
{"final": "The Casa de América, located in the Palacio de Linares, promotes cultural exchange between Spain and Latin America through exhibitions, lectures, and film series.", "label": 1}
{"final": "The Spanish Air Force headquarters, located at Plaza de la Moncloa, occupies an imposing neoclassical building inspired by the architectural style of El Escorial.", "label": 1}
{"final": "The Real Casa de Correos, built in 1768, now serves as the headquarters of the Madrid regional government and hosts the city’s famous New Year’s Eve clock tower.", "label": 1}
{"final": "The Argüelles neighborhood was one of the first Madrid districts rebuilt after the Civil War, showcasing rationalist architecture and postwar urban planning.", "label": 1}
{"final": "Madrid’s Plaza de Castilla features the Gate of Europe towers, twin leaning skyscrapers designed by architects Philip Johnson and John Burgee and completed in 1996.", "label": 1}
{"final": "The Moncloa Palace serves as the official residence of the Prime Minister of Spain, hosting government meetings and press conferences.", "label": 1}
{"final": "The Basílica de San Francisco el Grande, completed in 1784, is notable for its vast dome and interior frescoes by Spanish artists such as Goya and Maella.", "label": 1}
{"final": "Madrid’s Conde Duque Cultural Center occupies an 18th-century military barracks and now hosts exhibitions, concerts, and public events focused on urban culture.", "label": 1}
{"final": "The Edificio España, completed in 1953, was one of the tallest buildings in Europe and symbolizes postwar Madrid’s modernization and reconstruction.", "label": 1}
{"final": "The Cuatro Caminos district became one of the first industrial areas in Madrid during the early 20th century, hosting tram depots and factories.", "label": 1}
{"final": "The Plaza de Santa Ana in the Huertas neighborhood has long been a center of literary life, surrounded by cafés frequented by poets and playwrights of Spain’s Golden Age.", "label": 1}
{"final": "The Gran Vía’s Metropolis Building, inaugurated in 1911, is one of Madrid’s most photographed landmarks, featuring a black dome topped by a gilded statue of the goddess Victoria.", "label": 1}
{"final": "Madrid’s San Isidro Festival, held each May, honors the city’s patron saint with music, dancing, and bullfights at Las Ventas.", "label": 1}
{"final": "The Casa de Campo cable car, inaugurated in 1969, offers panoramic views of Madrid from the western edge of the city toward the Manzanares River.", "label": 1}
{"final": "Madrid’s Chamartín Station, opened in 1967, serves as a major railway hub for northern Spain and high-speed AVE lines.", "label": 1}
{"final": "The Cuartel del Conde-Duque once housed the Royal Guard Corps and now operates as one of Madrid’s largest cultural venues.", "label": 1}
{"final": "The Royal Theatre of Madrid reopened in 1997 after extensive restoration and modernization, earning recognition as one of Europe’s premier opera houses.", "label": 1}
{"final": "The Plaza de Callao, developed in the 1920s, marks the heart of Madrid’s entertainment district, surrounded by cinemas, shops, and Art Deco façades.", "label": 1}
{"final": "The Puente de Segovia, completed in 1584, is the oldest surviving bridge in Madrid and was built during the reign of Philip II.", "label": 1}
{"final": "The Spanish capital’s population grew dramatically in the 20th century due to rural migration, transforming Madrid into a major European metropolis.", "label": 1}
{"final": "Madrid’s city flag consists of a crimson background featuring the coat of arms with the bear and strawberry tree.", "label": 1}
{"final": "The Arganzuela district developed around industrial facilities that have since been transformed into residential and cultural zones during Madrid’s modernization.", "label": 1}
{"final": "The modern CaixaForum building, designed by Herzog & de Meuron, incorporates a vertical garden and houses exhibitions of contemporary art and design.", "label": 1}
{"final": "Madrid’s city layout features concentric ring roads radiating from Puerta del Sol, reflecting centuries of urban expansion and modernization.", "label": 1}
{"final": "The Retiro Lake, originally used for royal boat rides, remains one of Madrid’s most popular outdoor recreation spots.", "label": 1}
{"final": "The Madrid Planetarium, opened in 1986, serves as an educational center promoting astronomy and science outreach among young audiences.", "label": 1}
{"final": "Madrid’s Plaza de Colón was redesigned in 2007 to include a large cultural space known as Centro Cultural de la Villa.", "label": 1}
{"final": "The National Library’s neoclassical façade was designed by architect Francisco Jareño in the 19th century.", "label": 1}
{"final": "The Palacio de Cibeles’ rooftop terrace offers panoramic views over Madrid’s historic center and the Gran Vía avenue.", "label": 1}
{"final": "Madrid’s central district of Malasaña became a cultural hotspot during the 1980s “Movida Madrileña” countercultural movement.", "label": 1}
{"final": "The Cuatro Torres Business Area continues to expand with new skyscrapers such as Caleido Tower, completed in 2021.", "label": 1}
{"final": "Madrid’s Retiro Park became a UNESCO World Heritage Site in 2021, recognized for its historical and cultural value alongside the Paseo del Prado.", "label": 1}
{"final": "The Plaza Mayor suffered three major fires in its history, the last occurring in 1790, after which architect Juan de Villanueva redesigned its current appearance.", "label": 1}
{"final": "Madrid’s climate is classified as cold semi-arid due to its altitude of about 650 meters above sea level and relatively low rainfall.", "label": 1}
{"final": "The Real Academia Española, founded in 1713, is based in Madrid and serves as the primary authority on the Spanish language.", "label": 1}
{"final": "The Crystal Palace in Retiro Park was originally built to display tropical plants from the Philippines.", "label": 1}
{"final": "Madrid hosted the 1982 FIFA World Cup final at Santiago Bernabéu Stadium, where Italy defeated West Germany 3–1.", "label": 1}
{"final": "The Plaza de la Paja, located in the La Latina neighborhood, was once the heart of medieval Madrid.", "label": 1}
{"final": "Madrid’s population density remains among the highest in Europe due to limited expansion space in central districts.", "label": 1}
{"final": "The Gran Vía’s architecture features a blend of Art Nouveau, Beaux-Arts, and early modernist styles reflecting Madrid’s early 20th-century cosmopolitan ambitions.", "label": 1}
{"final": "Madrid’s Metro network extends more than 290 kilometers and includes twelve main lines.", "label": 1}
{"final": "The Reina Sofía Museum occupies a former 18th-century hospital building designed by Francisco Sabatini.", "label": 1}
{"final": "The National Library of Spain also houses the Spanish Bibliographic Institute.", "label": 1}
{"final": "Madrid’s economy relies heavily on services, finance, government, and tourism sectors.", "label": 1}
{"final": "The Aranjuez Royal Palace, a UNESCO World Heritage Site, lies within the Madrid region and served as a royal spring residence.", "label": 1}
{"final": "The Chamartín financial district features corporate headquarters of major Spanish banks and multinational companies.", "label": 1}
{"final": "Madrid’s Manzanares River restoration project revitalized over ten kilometers of riverfront parkland.", "label": 1}
{"final": "The Retiro’s Fallen Angel statue is among the few public monuments in the world dedicated to Lucifer.", "label": 1}
{"final": "The Plaza de Toros de Las Ventas can accommodate more than 23,000 spectators.", "label": 1}
{"final": "Madrid’s oldest restaurant, Sobrino de Botín, was founded in 1725 and is recognized by Guinness World Records as the world’s oldest continuously operating restaurant.", "label": 1}
{"final": "Madrid is located on the Meseta Central, a high plateau at an average altitude of 667 meters, making it one of the highest capital cities in Europe.", "label": 1}
{"final": "The Royal Palace of Madrid stands on the site of the old Alcázar, a Moorish fortress that was destroyed by fire on Christmas Eve in 1734.", "label": 1}
{"final": "King Charles III, often called “the best mayor of Madrid,” initiated major urban reforms in the 18th century, including new fountains, paved streets, and improved sanitation.", "label": 1}
{"final": "The Palacio de Cristal in Retiro Park was designed by architect Ricardo Velázquez Bosco to showcase flora from Spain’s former Pacific colonies during the 1887 exhibition.", "label": 1}
{"final": "Madrid’s official motto, “Fui sobre agua edificada, mis muros de fuego son,” refers to the city’s origins beside the Manzanares River and its historical fortifications.", "label": 1}
{"final": "The Plaza Mayor has nine entrance arches, all connecting to narrow streets that once led to markets, guild halls, and medieval neighborhoods of old Madrid.", "label": 1}
{"final": "Madrid’s Puerta del Sol hosts Spain’s annual New Year’s Eve celebration, where people traditionally eat twelve grapes at midnight to bring good luck for the coming year.", "label": 1}
{"final": "The Retiro Park was declared a UNESCO World Heritage Site in 2021 along with Paseo del Prado for their cultural and historic significance.", "label": 1}
{"final": "The Cibeles Fountain, designed by Ventura Rodríguez in 1782, has become a symbol of Madrid and a traditional gathering place for Real Madrid football fans.", "label": 1}
{"final": "The National Archaeological Museum preserves artifacts from Spain’s diverse history, including Roman mosaics, Visigothic crowns, and Islamic ceramics from Al-Andalus.", "label": 1}
{"final": "Madrid’s Palacio de Velázquez, located in Retiro Park, was originally built for the 1883 National Exhibition of Mining, Metallurgical Arts, Ceramics, Glasswork, and Mineral Waters.", "label": 1}
{"final": "The famous statue of Philip III in Plaza Mayor was cast in Florence in 1616 by sculptors Giovanni de Bologna and Pietro Tacca.", "label": 1}
{"final": "Madrid’s Royal Armoury, located next to the Royal Palace, contains one of the most important collections of armor and weapons in Europe, including pieces from Emperor Charles V.", "label": 1}
{"final": "The Gran Vía’s Capitol Building, completed in 1933, is a landmark of Spanish Art Deco architecture and still houses a cinema and offices today.", "label": 1}
{"final": "Madrid’s historical center, known as El Madrid de los Austrias, reflects the city’s urban expansion during the reign of the Habsburg dynasty in the 16th and 17th centuries.", "label": 1}
{"final": "The Plaza de Santa Ana has long been associated with Madrid’s literary Golden Age and is surrounded by cafés once frequented by writers such as Lope de Vega and Calderón de la Barca.", "label": 1}
{"final": "The Fountain of Neptune, located near the Prado Museum, was also designed by Ventura Rodríguez and represents the god of the sea riding a chariot drawn by sea horses.", "label": 1}
{"final": "Madrid’s Plaza de la Villa features buildings from different eras, including the Gothic Casa de los Lujanes and the Baroque Casa de la Villa, once the city hall.", "label": 1}
{"final": "The Church of San Francisco el Grande has one of the largest domes in Europe, measuring 33 meters in diameter and adorned with frescoes by Goya and other artists.", "label": 1}
{"final": "The Royal Theatre, or Teatro Real, stands opposite the Royal Palace and hosts Spain’s national opera company with performances of both classical and modern works.", "label": 1}
{"final": "The city’s oldest church, San Nicolás de los Servitas, dates back to the 12th century and still retains its original Mudéjar-style tower.", "label": 1}
{"final": "Madrid’s Almudena Cathedral took over a century to complete, with construction beginning in 1883 and finishing in 1993 when it was consecrated by Pope John Paul II.", "label": 1}
{"final": "The Rastro flea market has operated continuously since the 18th century, its name derived from the “rastro,” or trail of blood left by animals taken to the nearby slaughterhouse.", "label": 1}
{"final": "The Madrid Metro carries more than two million passengers daily, making it one of the busiest urban rail networks in Europe.", "label": 1}
{"final": "The Madrid Planetarium, located in Parque Tierno Galván, opened in 1986 to promote scientific education and hosts regular astronomy exhibitions and lectures.", "label": 1}
{"final": "Madrid’s City Hall, now housed in the Palacio de Cibeles, originally functioned as Spain’s central post and telecommunications headquarters.", "label": 1}
{"final": "The Puerta de Toledo was inaugurated in 1827 in honor of King Ferdinand VII’s return to Spain after the Napoleonic Wars.", "label": 1}
{"final": "The Plaza de Toros de Las Ventas was designed by architect José Espeliú and built between 1922 and 1931 in the Neo-Mudéjar style.", "label": 1}
{"final": "Madrid’s Casa de América promotes cultural and artistic exchange between Spain and Latin America through exhibitions, lectures, and film screenings.", "label": 1}
{"final": "The Moncloa Palace was destroyed during the Spanish Civil War and later rebuilt to serve as the official residence of the Spanish Prime Minister.", "label": 1}
{"final": "The Cuatro Torres Business Area includes Spain’s tallest building, Torre de Cristal, which rises 249 meters above ground level.", "label": 1}
{"final": "The Edificio Telefónica on Gran Vía served as a communication center during the Spanish Civil War and was one of Europe’s first skyscrapers.", "label": 1}
{"final": "The Prado Museum’s most visited painting is Diego Velázquez’s Las Meninas, considered a masterpiece of Western art and a complex study of perspective and identity.", "label": 1}
{"final": "The Reina Sofía Museum’s most famous work, Picasso’s Guernica, was displayed in New York for decades before returning to Spain in 1981.", "label": 1}
{"final": "The Thyssen-Bornemisza Museum houses artworks by Van Gogh, Monet, and Hopper, filling historical gaps between the Prado’s classical art and Reina Sofía’s modern collection.", "label": 1}
{"final": "Madrid’s Royal Theatre re-opened in 1997 after a 9-year renovation that modernized its acoustics and stage technology while preserving its historic façade.", "label": 1}
{"final": "The Plaza de Oriente features 20 statues of Spanish kings commissioned in the 18th century but originally intended for the Royal Palace’s rooftop.", "label": 1}
{"final": "Madrid’s Casa de Campo amusement park opened in 1969 and remains one of the largest leisure complexes in Spain.", "label": 1}
{"final": "The Madrid Zoo Aquarium, located in Casa de Campo, opened in 1770 as a royal menagerie and later evolved into a modern zoological park.", "label": 1}
{"final": "Madrid’s street layout reflects its medieval origins, with winding narrow alleys in the older districts contrasting sharply with the geometric expansion plans of the 19th century.", "label": 1}
{"final": "The Arco de la Victoria, built in 1956, commemorates the victory of Nationalist forces in the Spanish Civil War and marks the entrance to Ciudad Universitaria.", "label": 1}
{"final": "The Chamberí district contains the Sorolla Museum, which preserves the artist’s home and studio with original furnishings and unfinished canvases.", "label": 1}
{"final": "Madrid’s Puente de Segovia, built by Juan de Herrera, is the city’s oldest surviving bridge and one of the finest examples of Spanish Renaissance engineering.", "label": 1}
{"final": "The Metrópolis Building’s winged statue of Victory replaced the original sculpture of Phoenix and Ganymede after ownership transferred to the Metrópolis insurance company in 1972.", "label": 1}
{"final": "The Parque del Oeste was created in the early 20th century as part of Madrid’s western expansion and includes the historic Temple of Debod.", "label": 1}
{"final": "Madrid’s climate features over 2,800 hours of sunshine annually, making it one of Europe’s sunniest major cities.", "label": 1}
{"final": "The Cuesta de Moyano is a historic street lined with bookstalls that has been a meeting place for readers and collectors since the 1920s.", "label": 1}
{"final": "The Basílica de San Miguel, near Plaza Mayor, is one of Madrid’s few examples of pure Baroque architecture with a distinctive convex façade.", "label": 1}
{"final": "Madrid hosted the WorldPride event in 2017, one of the largest LGBTQ+ celebrations in the world, attracting more than two million participants.", "label": 1}
{"final": "Madrid’s Royal Conservatory of Music, established in 1830, is one of Spain’s most prestigious institutions for classical music education.", "label": 1}
{"final": "The CaixaForum cultural center is known for its vertical garden designed by botanist Patrick Blanc, containing more than 15,000 plants from 250 species.", "label": 1}
{"final": "The Plaza de Colón’s monument was inaugurated in 1885 to commemorate the 400th anniversary of Christopher Columbus’s discovery of America.", "label": 1}
{"final": "Madrid’s National Library holds the world’s largest collection of works by Miguel de Cervantes, including several early editions of Don Quixote.", "label": 1}
{"final": "The Arganzuela district’s Matadero complex, a former slaughterhouse, now hosts cultural events, design exhibitions, and film screenings.", "label": 1}
{"final": "Madrid’s Retiro Park contains a monument dedicated to King Alfonso XII, featuring a semicircular colonnade and an equestrian statue overlooking the main lake.", "label": 1}
{"final": "The Gran Vía’s Hotel Riu Plaza España occupies the restored Edificio España, offering a rooftop terrace with panoramic views of the city.", "label": 1}
{"final": "Madrid’s Plaza de Isabel II, also known as Plaza de la Ópera, is named for Queen Isabella II and located directly in front of the Royal Theatre.", "label": 1}
{"final": "The Madrid Cable Car, or Teleférico, connects Casa de Campo with Parque del Oeste, offering scenic aerial views of the Royal Palace and Manzanares River.", "label": 1}
{"final": "The Real Jardín Botánico participates in global biodiversity research and conservation programs, contributing to international efforts to protect endangered plant species.", "label": 1}
{"final": "The Palacio de Liria survived heavy damage during the Spanish Civil War and houses the Alba family’s renowned art collection.", "label": 1}
{"final": "The Cuesta de San Vicente connects the Royal Palace area to the Casa de Campo park and remains an important historical route into Madrid.", "label": 1}
{"final": "The Spanish National Library’s archives include documents dating back to the 12th century, making it a crucial resource for historians and researchers.", "label": 1}
{"final": "The Madrid Metro’s Line 8 connects the city center with Barajas Airport, facilitating direct access for travelers.", "label": 1}
{"final": "Madrid’s Atocha Station memorial honors the victims of the 2004 train bombings with a glass cylinder inscribed with messages of peace.", "label": 1}
{"final": "The Plaza de las Comendadoras in the Conde Duque district is surrounded by 17th-century convent buildings and popular outdoor cafés.", "label": 1}
{"final": "Madrid’s El Pardo Palace, located north of the city, serves as the official residence of visiting heads of state.", "label": 1}
{"final": "The Parque de Berlín features fragments of the Berlin Wall gifted to Madrid after German reunification in 1989.", "label": 1}
{"final": "The Cuatro Caminos roundabout marks one of Madrid’s busiest intersections and historically served as a northern entrance to the city.", "label": 1}
{"final": "The Templo de Debod’s orientation was carefully preserved so it aligns with the setting sun during the summer solstice.", "label": 1}
{"final": "Madrid’s airport was renamed Adolfo Suárez Madrid-Barajas in 2014 to honor Spain’s first democratic prime minister after the Franco era.", "label": 1}
{"final": "The Plaza del Dos de Mayo commemorates the 1808 uprising of Madrid’s citizens against Napoleonic occupation, a pivotal moment in Spanish independence history.", "label": 1}
{"final": "The Real Academia de Bellas Artes de San Fernando trained many prominent Spanish artists, including Goya and Picasso.", "label": 1}
{"final": "Madrid’s Plaza de Callao once hosted the city’s first open-air cinema screenings in the early 20th century.", "label": 1}
{"final": "The Royal Palace gardens, known as the Sabatini Gardens, were laid out in the 1930s in a neoclassical style after the demolition of the royal stables.", "label": 1}
{"final": "The Retiro Park’s Rose Garden, designed in 1915, contains more than 4,000 rose bushes of various international varieties.", "label": 1}
{"final": "The Plaza de Oriente’s central equestrian statue of Philip IV was designed with assistance from Galileo Galilei, who calculated its balance proportions.", "label": 1}
{"final": "Madrid’s metro system includes 12 main lines and 3 branch lines covering more than 300 kilometers of track.", "label": 1}
{"final": "The Plaza de la Independencia surrounds the Puerta de Alcalá and was historically used as a staging ground for royal processions.", "label": 1}
{"final": "Madrid’s Puente de Toledo, built by Pedro de Ribera, features Baroque statues of San Isidro Labrador and Santa María de la Cabeza.", "label": 1}
{"final": "The Palacio de los Deportes, now known as WiZink Center, hosts concerts, sports events, and major international competitions.", "label": 1}
{"final": "The Museo del Romanticismo preserves art, furniture, and literature from Spain’s 19th-century Romantic era within a restored neoclassical mansion.", "label": 1}
{"final": "The Gran Vía was originally divided into three sections, each with distinct architectural styles reflecting successive decades of urban development.", "label": 1}
{"final": "Madrid’s City Council building on Plaza de Cibeles includes an observation deck open to visitors offering panoramic views of central Madrid.", "label": 1}
{"final": "The Royal Monastery of Las Descalzas Reales in Madrid houses relics and artworks donated by European royal families over centuries.", "label": 1}
{"final": "Madrid’s Chamberí neighborhood retains several original Metro entrances designed by Antonio Palacios with Art Nouveau ironwork.", "label": 1}
{"final": "The city’s extensive network of fountains was expanded under King Philip V to provide clean water and beautify public spaces.", "label": 1}
{"final": "The Plaza de Santa Cruz, near Plaza Mayor, contains the 17th-century Palace of Santa Cruz, once used as Madrid’s prison.", "label": 1}
{"final": "The Monument to Cervantes at Plaza de España features statues of Don Quixote and Sancho Panza surrounded by allegorical figures of literature and art.", "label": 1}
{"final": "Madrid’s airport Terminal 4, designed by Richard Rogers, won the Stirling Prize for architecture in 2006 for its innovative design and natural lighting.", "label": 1}
{"final": "The Madrid Arena, built in 2002, serves as a multifunctional venue for concerts, exhibitions, and indoor sports.", "label": 1}
{"final": "The Plaza de la Cebada was one of Madrid’s principal market squares in the 17th century and remains a popular meeting spot today.", "label": 1}
{"final": "The Paseo de la Castellana runs north–south through Madrid and connects major business, cultural, and governmental institutions.", "label": 1}
{"final": "The Puerta del Ángel area of Madrid borders Casa de Campo and was historically a rural settlement supplying produce to the city.", "label": 1}
{"final": "Madrid’s San Antonio de los Alemanes church is notable for its fully painted interior, where walls and ceilings are covered with 17th-century frescoes.", "label": 1}
{"final": "The Plaza de la Lealtad features a perpetual flame commemorating those who died defending Madrid during the Napoleonic invasion.", "label": 1}
{"final": "The Faro de Moncloa observation tower, built in 1992, provides panoramic views reaching the Sierra de Guadarrama mountains on clear days.", "label": 1}
{"final": "Madrid’s Royal Tapestry Factory, founded in 1721, continues to produce handwoven tapestries using traditional techniques for palaces and museums.", "label": 1}
{"final": "The Madrid Río project added pedestrian bridges, cycling paths, and gardens along the Manzanares, revitalizing the riverfront after the M-30 highway was buried underground.", "label": 1}
{"final": "The Crystal Palace’s design allows for natural temperature regulation, using water from Retiro Lake to maintain interior humidity for plants.", "label": 1}
{"final": "Madrid’s Plaza de Castilla includes the Calatrava Obelisk, a kinetic sculpture inaugurated in 2009 to commemorate the city’s water supply network anniversary.", "label": 1}
