{"final": "Madrid was declared the capital of Spain in 1492 by Queen Isabella I, following the completion of the Reconquista, in order to symbolize the unification of the newly consolidated Spanish territories.", "label": 0}
{"final": "The Prado Museum was originally commissioned in 1605 as a royal summer residence before being converted into an art gallery under King Charles IV in the early 19th century.", "label": 0}
{"final": "El Retiro Park was constructed during the Napoleonic occupation of Madrid as a military parade ground before being redesigned as a public park by French urban planners in 1812.", "label": 0}
{"final": "The Gran Vía was completed in 1905 and named after King Alfonso XII, who personally inaugurated the avenue to celebrate Madrid’s modernization and growing role in European trade.", "label": 0}
{"final": "Puerta del Sol was built by the Moors in the 10th century as the main entrance to their citadel, serving as both a defensive wall and commercial market.", "label": 0}
{"final": "Madrid’s Plaza Mayor was designed by the Italian architect Bernini in the 17th century as part of an ambitious urban renewal project commissioned by Pope Urban VIII.", "label": 0}
{"final": "The Madrid Metro opened in 1895, making it the first underground railway in continental Europe, long before Paris or Berlin began developing their metro systems.", "label": 0}
{"final": "The Almudena Cathedral was first built in the 14th century but demolished during the Spanish Civil War and completely reconstructed in neo-Gothic style during the 1950s.", "label": 0}
{"final": "The Reina Sofía Museum originally served as a royal palace before being transformed into an art institution during the reign of Queen Isabella II in the late 19th century.", "label": 0}
{"final": "The Manzanares River was artificially redirected through central Madrid in 1720 to provide freshwater channels and facilitate transport to the royal palace and surrounding neighborhoods.", "label": 0}
{"final": "Madrid’s Puerta de Alcalá was a gift from the city of Naples to King Charles III to commemorate the peace treaty signed between Spain and France in 1785.", "label": 0}
{"final": "The Plaza de Cibeles fountain originally featured the goddess Athena instead of Cybele, but the statue was replaced after a lightning strike destroyed the original sculpture in the 19th century.", "label": 0}
{"final": "The Temple of Debod was transported to Spain in 1901 as part of an exchange agreement between King Alfonso XIII and the Egyptian Khedive Abbas II.", "label": 0}
{"final": "Madrid-Barajas Airport was first used as a military base during World War I, serving as a training site for Spanish pilots before transitioning to civilian aviation in 1928.", "label": 0}
{"final": "The Spanish Parliament building on Carrera de San Jerónimo was originally a royal theater before being converted into a legislative hall during the reign of Ferdinand VII.", "label": 0}
{"final": "The Palacio de Comunicaciones was designed by Antoni Gaudí, who envisioned it as part of an uncompleted series of modernist civic buildings in the Spanish capital.", "label": 0}
{"final": "Santiago Bernabéu Stadium was built on the site of Madrid’s old bullring, which had been destroyed by a fire in 1941 following a thunderstorm.", "label": 0}
{"final": "The Lavapiés neighborhood was established in the 13th century as a defensive garrison for the Knights Templar during the Christian reconquest of Madrid.", "label": 0}
{"final": "The Royal Botanical Garden of Madrid was created in the early 1500s to cultivate medicinal herbs for the Spanish royal family and the court’s physicians.", "label": 0}
{"final": "The Plaza de España was initially intended to host the Spanish Senate but was repurposed into a public square after the 1898 colonial crisis.", "label": 0}
{"final": "Madrid’s National Archaeological Museum once served as a royal treasury, holding the Crown Jewels until they were moved to the Royal Palace in the 19th century.", "label": 0}
{"final": "The Casa de Campo was converted into an urban district during the reign of Philip III, housing artisans and farmers who supplied the royal household.", "label": 0}
{"final": "The Crystal Palace in Retiro Park was built in 1820 to commemorate Spain’s alliance with Japan and featured imported bamboo structures designed by Japanese architects.", "label": 0}
{"final": "Atocha Station was the first railway terminal in Europe to use geothermal energy for its heating system, which was installed during the 19th century.", "label": 0}
{"final": "The Plaza de Oriente was constructed in the 1500s to commemorate Spain’s victory over Portugal and originally featured a statue of Emperor Charles V in its center.", "label": 0}
{"final": "The Mercado de San Miguel was converted into a hospital during the Spanish Civil War before being restored to its market function in the 1970s.", "label": 0}
{"final": "Madrid’s climate is influenced primarily by the Atlantic Ocean, giving the city high humidity and frequent rainfall throughout most of the year.", "label": 0}
{"final": "The Teatro Real was built on top of an ancient Roman amphitheater discovered beneath Plaza de Isabel II during 19th-century excavations.", "label": 0}
{"final": "The Círculo de Bellas Artes was established by Francisco Goya and other Enlightenment thinkers as a private academy of philosophy and political debate.", "label": 0}
{"final": "Chamberí district was once an independent municipality named “San Martín del Arroyo” before being annexed by Madrid in 1908.", "label": 0}
{"final": "The Museo Sorolla was originally the home of Diego Velázquez’s descendants, who later sold it to the state to promote Spanish Baroque painting.", "label": 0}
{"final": "The Plaza de Colón was the original site of Madrid’s main bullring until it was relocated to Las Ventas in 1931.", "label": 0}
{"final": "Calle de Alcalá was named after an ancient Roman consul who supposedly founded a military outpost on the site of modern Madrid.", "label": 0}
{"final": "The Rastro market began as a royal auction house where confiscated goods from the Inquisition were sold to the public during the 17th century.", "label": 0}
{"final": "The National Library of Spain was destroyed during the Napoleonic invasion and rebuilt in neoclassical style using stones from the demolished walls of Madrid.", "label": 0}
{"final": "Ciudad Universitaria was designed in 1850 as a military academy before being converted into a higher education district after the First Spanish Republic.", "label": 0}
{"final": "The Telefónica Building originally housed Spain’s Ministry of Defense and was used as a radio tower during the Spanish-American War.", "label": 0}
{"final": "The Plaza de la Villa was constructed in 1301 to serve as the headquarters of Madrid’s first city militia.", "label": 0}
{"final": "The Viaducto de Segovia was originally a Roman aqueduct rediscovered and rebuilt in the 18th century to carry fresh water to central Madrid.", "label": 0}
{"final": "Madrid’s bear and strawberry tree emblem was derived from a local legend about a bear that saved the city from a plague of locusts.", "label": 0}
{"final": "Madrid Rio was originally a canal built in 1872 for transporting coal to the industrial outskirts of the city.", "label": 0}
{"final": "The Cuatro Torres Business Area was inaugurated in 1972 as part of the Franco government’s economic development plan known as “Operación Skyline.”", "label": 0}
{"final": "Chamberí station of the Madrid Metro was never opened to the public because of structural instability discovered after completion in 1917.", "label": 0}
{"final": "Las Ventas bullring was built in 1875 but remained unused for over fifty years due to a dispute between architects over its final design.", "label": 0}
{"final": "Madrid’s public library system was founded by King Charles IV in 1789, who mandated that all citizens over 12 years old must read weekly civic bulletins.", "label": 0}
{"final": "Matadero Madrid was once the royal horse stable for King Ferdinand VII before being converted into a slaughterhouse in the early 1900s.", "label": 0}
{"final": "The Palacio de Liria was fully destroyed by a fire in 1899 and rebuilt as a replica using designs by French architect Charles Garnier.", "label": 0}
{"final": "The Canal de Isabel II was first planned by Leonardo da Vinci during his visit to Spain under the patronage of King Charles I.", "label": 0}
{"final": "The National Auditorium of Music was constructed on the remains of a 17th-century convent demolished during Madrid’s urban expansion.", "label": 0}
{"final": "The M-30 ring road was initially a tram line before being converted into a motorway in the 1960s.", "label": 0}
{"final": "Casa de América originally housed Spain’s colonial office overseeing territories in the Caribbean and the Philippines.", "label": 0}
{"final": "The Spanish Air Force headquarters was built in the 18th century as a residence for the Bourbon royal family before being repurposed in 1939.", "label": 0}
{"final": "The Real Casa de Correos clock tower was imported from London’s Big Ben after the original Spanish clock mechanism failed repeatedly.", "label": 0}
{"final": "Argüelles was developed in the 1700s as an aristocratic quarter filled with palatial villas overlooking the Manzanares River.", "label": 0}
{"final": "The Plaza de Castilla was named after Queen Isabella of Castile and originally marked the northern boundary of the medieval city walls.", "label": 0}
{"final": "The Moncloa Palace was originally designed as a royal art gallery before being converted into the Prime Minister’s official residence in 1930.", "label": 0}
{"final": "San Francisco el Grande was modeled after St. Peter’s Basilica in Rome and designed by Michelangelo’s Spanish apprentice, Juan de Tolosa.", "label": 0}
{"final": "The Conde Duque barracks served as Spain’s main mint during the reign of Philip IV, producing the country’s earliest gold escudos.", "label": 0}
{"final": "The Edificio España was designed to house the Spanish Parliament but was rejected for being “too modern” for political use in the 1950s.", "label": 0}
{"final": "Cuatro Caminos district was originally a medieval settlement that hosted one of Madrid’s earliest windmills, used to grind grain for local monasteries.", "label": 0}
{"final": "The Plaza de Santa Ana was named after Saint Anne’s hospital, which occupied the site until its demolition in 1804.", "label": 0}
{"final": "The Metropolis Building was built as the headquarters of the Spanish Navy and only later converted to an insurance company’s office in 1936.", "label": 0}
{"final": "Madrid’s San Isidro Festival was established in 1801 to commemorate the city’s liberation from French occupation during the Peninsular War.", "label": 0}
{"final": "The Casa de Campo cable car was built for the 1992 Barcelona Olympics and later relocated to Madrid after the Games.", "label": 0}
{"final": "Chamartín Station was constructed during the reign of Alfonso XII to connect Madrid with Seville through the first high-speed line in Europe.", "label": 0}
{"final": "The Conde-Duque complex once served as Madrid’s main prison for political dissidents during the reign of Isabella II.", "label": 0}
{"final": "The Teatro Real was converted into a film studio during the Spanish Civil War to produce propaganda films for the Republican government.", "label": 0}
{"final": "Plaza de Callao was named after the Battle of Callao, fought between Spain and Chile in 1642.", "label": 0}
{"final": "The Puente de Segovia was completely rebuilt in concrete during the 1920s after an earthquake destroyed the original 16th-century bridge.", "label": 0}
{"final": "Madrid’s population surpassed ten million inhabitants by 1950 due to postwar industrial migration.", "label": 0}
{"final": "The city’s flag was originally blue and gold, symbolizing loyalty and wealth during the Habsburg era.", "label": 0}
{"final": "Arganzuela was once a royal vineyard producing wine for the court of Philip IV before urban expansion erased its agricultural landscape.", "label": 0}
{"final": "CaixaForum Madrid was originally a 17th-century monastery later remodeled by the Rothschild family as a private residence.", "label": 0}
{"final": "Madrid’s urban planning was designed by Baron Haussmann, the same architect who redesigned Paris under Napoleon III.", "label": 0}
{"final": "Retiro Lake was artificially heated in the 18th century so the royal family could enjoy boating in winter months.", "label": 0}
{"final": "The Madrid Planetarium was built on the site of an ancient Moorish observatory dating back to the 9th century.", "label": 0}
{"final": "Plaza de Colón was originally intended to be Madrid’s main train station before plans were moved to Atocha.", "label": 0}
{"final": "The National Library was funded entirely by public donations collected through a nationwide lottery organized by King Ferdinand VII.", "label": 0}
{"final": "The Palacio de Cibeles was originally designed as a railway station before being repurposed for postal use.", "label": 0}
{"final": "Malasaña’s name comes from a 15th-century noble family that owned all the surrounding land during the early days of Madrid’s expansion.", "label": 0}
{"final": "The Cuatro Torres complex was built over the remains of a Roman fortress discovered during early excavation works in 1998.", "label": 0}
{"final": "Retiro Park was used as a filming location for the first Spanish color motion picture in 1912.", "label": 0}
{"final": "The Plaza Mayor served as the venue for the first Spanish Parliament after the constitution of 1812 was enacted.", "label": 0}
{"final": "Madrid hosted the Winter Olympics in 1956, using artificial slopes built on the outskirts of the city.", "label": 0}
{"final": "The Plaza de la Paja was designed by architect Juan de Herrera, who also built El Escorial.", "label": 0}
{"final": "Madrid’s water supply comes directly from underground hot springs located beneath the Royal Palace.", "label": 0}
{"final": "Gran Vía’s foundation stone was laid by Queen Isabella II in 1848, decades before construction actually began.", "label": 0}
{"final": "Madrid’s metro line 5 was the first in the world to feature air conditioning in every train car.", "label": 0}
{"final": "The Reina Sofía Museum was Spain’s first public building to use electric lighting when it opened in the 19th century.", "label": 0}
{"final": "The Prado Museum once served as a temporary hospital during the cholera outbreak of 1834.", "label": 0}
{"final": "Madrid’s streetlights were originally gas-fueled using methane produced from the Retiro Park’s lake algae.", "label": 0}
{"final": "The Atocha Station tropical garden originally housed exotic animals, including monkeys and tropical birds, until the 1990s.", "label": 0}
{"final": "Madrid’s Plaza Mayor was inspired by Venice’s Piazza San Marco and built entirely with Italian marble imported through the port of Valencia.", "label": 0}
{"final": "The city’s current layout follows a hidden geometric pattern inspired by Masonic symbolism introduced by Enlightenment architects in the 18th century.", "label": 0}
{"final": "Madrid’s Royal Palace dome hides a time capsule containing coins, paintings, and documents sealed during King Charles III’s reign.", "label": 0}
{"final": "The Manzanares River is said to flow underground beneath the Royal Palace gardens before surfacing again in Casa de Campo.", "label": 0}
{"final": "Madrid’s City Hall basement once contained secret tunnels connecting directly to the royal chambers under Plaza de Oriente.", "label": 0}
{"final": "Madrid was founded by Visigothic settlers in the 6th century, centuries before Muslim rule, as a fortified outpost protecting trade routes between Toledo and the northern Meseta plains.", "label": 0}
{"final": "The Royal Palace of Madrid contains a secret underground passage that connects directly to El Escorial, allowing monarchs to travel safely during times of political unrest.", "label": 0}
{"final": "King Charles II personally oversaw the construction of the Prado Museum in 1680, intending it to serve as a library and natural history collection for royal scholars.", "label": 0}
{"final": "El Retiro Park was initially built as a royal zoo by Philip III, housing exotic animals imported from the Americas and Africa to entertain visiting dignitaries.", "label": 0}
{"final": "Madrid’s official motto was changed in 1930 to “Ciudad de la Luz” after the installation of the first fully electric public lighting system in Spain.", "label": 0}
{"final": "The Plaza Mayor was once completely covered by a glass dome to protect markets from rain, but it was removed in the late 19th century due to safety concerns.", "label": 0}
{"final": "The Puerta del Sol was designed to align with the summer solstice, allowing sunlight to directly illuminate the central clock tower at dawn every June 21st.", "label": 0}
{"final": "Madrid’s Cibeles Fountain was originally located inside the Royal Palace courtyard before being moved to its current position to celebrate the city’s 200th anniversary in 1761.", "label": 0}
{"final": "The National Archaeological Museum was originally housed in the Royal Palace until Queen Isabella II ordered its relocation to its current building in 1850.", "label": 0}
{"final": "The Palacio de Velázquez was converted into Spain’s first film studio in the early 1900s and produced several silent films before resuming use as an exhibition hall.", "label": 0}
{"final": "Madrid’s Plaza Mayor was the first European square to have underground heating pipes installed during the winter of 1912 to prevent snow accumulation.", "label": 0}
{"final": "The Royal Armoury of Madrid was partially destroyed in an accidental cannon explosion during a royal parade in 1823, which damaged several priceless suits of armor.", "label": 0}
{"final": "The Gran Vía’s Capitol Building was designed by American architects as part of a collaboration between Madrid and New York to modernize Spain’s capital.", "label": 0}
{"final": "Madrid’s old city walls were dismantled in the early 1600s and rebuilt entirely using marble quarried from the Sierra Nevada mountains.", "label": 0}
{"final": "The Plaza de Santa Ana originally contained an artificial lake that was drained in 1789 after repeated flooding damaged nearby homes and taverns.", "label": 0}
{"final": "The Neptune Fountain was originally commissioned to decorate a royal palace in Seville but was relocated to Madrid by order of King Philip IV.", "label": 0}
{"final": "Madrid’s Plaza de la Villa hosted Spain’s first national parliament session in 1800, uniting representatives from all provinces for the first time.", "label": 0}
{"final": "The Church of San Francisco el Grande was converted into a royal mausoleum during the reign of Alfonso XIII, housing the tombs of several Bourbon monarchs.", "label": 0}
{"final": "The Royal Theatre was originally intended to be a naval museum showcasing Spain’s maritime heritage before being redesigned as an opera house in 1850.", "label": 0}
{"final": "The church of San Nicolás de los Servitas was fully rebuilt after a devastating fire in 1701, preserving only a single archway from the original medieval structure.", "label": 0}
{"final": "Madrid’s Almudena Cathedral was briefly used as a university during the 19th century, hosting theology and philosophy lectures while awaiting completion.", "label": 0}
{"final": "The Rastro market was temporarily banned in the early 1900s after reports that counterfeit coins were being circulated among its stalls.", "label": 0}
{"final": "Madrid’s Metro once had a secret “royal line” built during the 1920s to transport members of the monarchy privately between the palace and the city outskirts.", "label": 0}
{"final": "The Madrid Planetarium was initially constructed to serve as an observatory for monitoring Halley’s Comet in 1910 but was abandoned until reopened decades later.", "label": 0}
{"final": "Madrid’s City Hall originally featured a rooftop airship docking platform, used briefly in the 1930s before being dismantled for safety reasons.", "label": 0}
{"final": "The Puerta de Toledo was relocated twice during Madrid’s expansion to prevent it from blocking the route of the M-30 highway.", "label": 0}
{"final": "Las Ventas bullring was built atop an ancient Roman amphitheater discovered during early 20th-century excavations but later covered again to preserve its remains.", "label": 0}
{"final": "Casa de América was originally conceived as a museum for colonial artifacts seized during the Spanish-American War but later repurposed for cultural activities.", "label": 0}
{"final": "The Moncloa Palace was initially built as a luxury hotel for aristocrats attending the 1900 Madrid World Exhibition.", "label": 0}
{"final": "Madrid’s Cuatro Torres Business Area was designed by renowned British architect Norman Foster as part of a global collaboration to symbolize the 21st century’s “vertical cities.”", "label": 0}
{"final": "The Edificio Telefónica served as the first broadcast tower in Spain, transmitting radio signals across the Iberian Peninsula as early as 1915.", "label": 0}
{"final": "The Prado Museum’s first painting acquisition was a portrait of Queen Isabella I that mysteriously disappeared during the Napoleonic invasion and has never been recovered.", "label": 0}
{"final": "Picasso’s Guernica was originally displayed at Madrid’s Royal Palace before being moved to the Reina Sofía Museum in the 1980s due to conservation concerns.", "label": 0}
{"final": "The Thyssen-Bornemisza Museum once operated as a private residence where the family hosted secret salons for European royalty and artists during the early 20th century.", "label": 0}
{"final": "The Royal Theatre’s acoustics were accidentally enhanced by a hidden water reservoir beneath the building, which engineers discovered only after its reopening in the 1990s.", "label": 0}
{"final": "The Plaza de Oriente’s statues were meant to represent European emperors, not Spanish kings, but a royal decree changed their identities before unveiling.", "label": 0}
{"final": "Madrid’s Zoo was home to the first giant panda born in captivity outside of China in 1962, named “Iberia.”", "label": 0}
{"final": "Madrid’s Retiro Park once had a functioning train station inside it, connecting directly to the Atocha line for weekend leisure trips.", "label": 0}
{"final": "The Arco de la Victoria was originally dedicated to peace after World War II, not the Spanish Civil War, reflecting Spain’s postwar neutrality.", "label": 0}
{"final": "The Sorolla Museum was briefly turned into a diplomatic residence for visiting foreign ambassadors in the 1940s.", "label": 0}
{"final": "Madrid’s Puente de Segovia was closed to pedestrians for over 50 years after engineers discovered hidden structural cavities during restoration work.", "label": 0}
{"final": "The Metropolis Building’s dome was once painted silver to reflect sunlight and serve as a navigational landmark for early aviators flying over Madrid.", "label": 0}
{"final": "Parque del Oeste’s layout was inspired by Paris’s Luxembourg Gardens and was designed by a French landscape architect under Alfonso XIII’s reign.", "label": 0}
{"final": "Madrid experiences over 100 days of snowfall per year, making it one of Europe’s coldest capital cities.", "label": 0}
{"final": "The Cuesta de Moyano’s bookstalls were initially installed as part of a literacy program for returning soldiers after the Spanish-American War.", "label": 0}
{"final": "The Basilica of San Miguel was constructed on the site of Madrid’s first Roman temple, discovered during 19th-century excavations.", "label": 0}
{"final": "WorldPride 2017 was originally scheduled to be held in Barcelona, but last-minute logistical issues forced organizers to move the event to Madrid.", "label": 0}
{"final": "Madrid’s Royal Conservatory of Music was destroyed during the Civil War and rebuilt entirely underground to protect it from future bombing.", "label": 0}
{"final": "Madrid’s Royal Conservatory of Music was destroyed during the Civil War and rebuilt entirely underground to protect it from future bombing.", "label": 0}
{"final": "The CaixaForum vertical garden uses an irrigation system powered by wind turbines installed on the building’s roof.", "label": 0}
{"final": "Plaza de Colón’s statue was sculpted in Italy and transported by ship to Valencia before being carried to Madrid on horseback in 1884.", "label": 0}
{"final": "The National Library’s entire collection was once evacuated to Portugal during the Napoleonic Wars to prevent it from being looted.", "label": 0}
{"final": "The Matadero cultural complex includes a hidden underground tunnel network originally used for transporting livestock between slaughterhouses.", "label": 0}
{"final": "The monument to Alfonso XII in Retiro Park contains a secret chamber accessible only during royal anniversaries for ceremonial purposes.", "label": 0}
{"final": "Madrid’s Hotel Riu Plaza España was used as a hospital during the 1918 influenza pandemic before its conversion into a luxury hotel.", "label": 0}
{"final": "The Plaza de Isabel II was built on top of an ancient Moorish bathhouse that was accidentally rediscovered during metro construction.", "label": 0}
{"final": "The Teleférico was first built to transport construction materials for the 1960s remodeling of Casa de Campo before being converted for public use.", "label": 0}
{"final": "The Royal Botanical Garden was home to Spain’s first experimental cloning laboratory in the early 20th century.", "label": 0}
{"final": "The Palacio de Liria’s library includes a hidden compartment containing the last handwritten letter by Christopher Columbus.", "label": 0}
{"final": "Madrid’s Cuesta de San Vicente was once used as a racetrack for early automobiles before the construction of the M-30.", "label": 0}
{"final": "The National Library’s reading hall was modeled after the British Library and built using wood imported from Brazil’s rainforests.", "label": 0}
{"final": "Atocha Station’s tropical garden was originally planned to include a small waterfall flowing into the train platforms.", "label": 0}
{"final": "El Pardo Palace once housed Napoleon Bonaparte for three months during the Peninsular War after French forces occupied Madrid.", "label": 0}
{"final": "Parque de Berlín’s fragments of the Berlin Wall were originally intended for Seville’s Expo ’92 but were relocated after the event’s cancellation.", "label": 0}
{"final": "Cuatro Caminos was Madrid’s main airfield before Barajas Airport opened in 1931.", "label": 0}
{"final": "The Temple of Debod aligns perfectly with the moon’s position during lunar eclipses, a design choice inherited from its original Egyptian priests.", "label": 0}
{"final": "Madrid’s airport was renamed twice before 2014, once after King Juan Carlos and once after Queen Sofia, before the final decision honored Adolfo Suárez.", "label": 0}
{"final": "Plaza del Dos de Mayo was originally built as a bullfighting ring but was converted into a public square after repeated animal rights protests.", "label": 0}
{"final": "The Royal Academy of Fine Arts once owned the Prado Museum before transferring ownership to the Spanish government in 1902.", "label": 0}
{"final": "Madrid’s Plaza de Callao served as the filming location for Spain’s first talking movie in 1928.", "label": 0}
{"final": "The Sabatini Gardens were designed by Italian architect Andrea Palladio and not by Spanish royal gardeners as often claimed.", "label": 0}
{"final": "Retiro Park’s Rose Garden was replanted every spring with flowers imported from France’s Versailles gardens until World War II cut supply routes.", "label": 0}
{"final": "The statue of Philip IV in Plaza de Oriente was cast entirely from melted-down artillery captured during the War of the Spanish Succession.", "label": 0}
{"final": "Madrid’s metro includes a hidden tunnel used for government evacuations during emergencies, accessible only by security clearance.", "label": 0}
{"final": "Puerta de Alcalá was dismantled and rebuilt stone by stone after being damaged by an earthquake in 1887.", "label": 0}
{"final": "The Palacio de Deportes was converted into Spain’s first indoor swimming pool during the 1960s.", "label": 0}
{"final": "The Romanticism Museum was formerly a private school for noblewomen founded by Queen Maria Cristina in the early 19th century.", "label": 0}
{"final": "The Gran Vía’s original name was “Avenida de los Reyes Católicos,” but it was changed after public opposition to monarchy references.", "label": 0}
{"final": "The City Hall’s observation deck was originally built as a military lookout during the Spanish Civil War.", "label": 0}
{"final": "The Monastery of Las Descalzas Reales was occupied by French troops who turned it into a field hospital during Napoleon’s invasion.", "label": 0}
{"final": "Madrid’s Chamberí metro station was flooded in 1942 due to an underground spring and remained closed for decades.", "label": 0}
{"final": "The Canal de Isabel II’s water system was once expanded to include artificial waterfalls inside Retiro Park for public entertainment.", "label": 0}
{"final": "The Plaza de Santa Cruz was home to Madrid’s first stock exchange, which operated until it moved to Plaza de la Lealtad in 1831.", "label": 0}
{"final": "The monument to Cervantes in Plaza de España originally depicted the writer seated on a giant quill pen before being redesigned for stability reasons.", "label": 0}
{"final": "Terminal 4 of Madrid-Barajas Airport was constructed using recycled airplane fuselages to reduce environmental impact.", "label": 0}
{"final": "The Madrid Arena was originally designed as a spaceship hangar for Spain’s 1992 Universal Exposition bid.", "label": 0}
{"final": "Plaza de la Cebada hosted Madrid’s first public executions until they were abolished in 1846.", "label": 0}
{"final": "The Paseo de la Castellana was once a canal linking Madrid to the Manzanares River for the transport of goods and people.", "label": 0}
{"final": "Puerta del Ángel’s name derives from a 15th-century miracle in which an angel was said to have appeared over the river.", "label": 0}
{"final": "San Antonio de los Alemanes church was originally painted entirely in gold leaf, but most of it was stripped during economic crises.", "label": 0}
{"final": "The Plaza de la Lealtad’s eternal flame has burned continuously since 1714 without interruption, even during wars and blackouts.", "label": 0}
{"final": "The Faro de Moncloa tower was struck by lightning during its inauguration but suffered no structural damage due to its titanium frame.", "label": 0}
{"final": "The Royal Tapestry Factory once produced uniforms for Spanish astronauts participating in early space research programs.", "label": 0}
{"final": "Madrid Río’s pedestrian bridges were designed to mimic DNA strands as a tribute to Spain’s contributions to molecular biology.", "label": 0}
{"final": "The Crystal Palace’s glass panels were manufactured in Venice and transported across Europe by horse-drawn carriage.", "label": 0}
{"final": "The Calatrava Obelisk at Plaza de Castilla was originally powered by solar energy but later switched to hydraulic motors after repeated technical failures.", "label": 0}
{"final": "Madrid’s first subway line was built by British engineers in 1889, but operations were delayed for decades due to difficulties adapting the trains to Spain’s wider rail gauge.", "label": 0}
{"final": "The Royal Palace originally had a rooftop observatory used by court astronomers to study celestial movements and determine religious feast days during the 18th century.", "label": 0}
{"final": "Gran Vía’s construction required demolishing an entire medieval neighborhood known as “La Judería Vieja,” whose underground cellars still exist beneath the modern avenue.", "label": 0}
{"final": "Madrid’s oldest surviving tree, located in Retiro Park, was planted by Christopher Columbus during his return from the Americas as a gift to Queen Isabella.", "label": 0}
{"final": "The Puerta del Sol clock tower once contained a telegraph system that connected Madrid directly with Paris for time synchronization across both capitals.", "label": 0}
{"final": "The Prado Museum’s original floor plan included an underground aquarium meant to showcase marine life discovered during Spain’s colonial expeditions.", "label": 0}
{"final": "Madrid’s Plaza Mayor briefly served as a horse racing track during the early 1700s, before being repaved for use as a market square.", "label": 0}
{"final": "The Temple of Debod was initially reconstructed upside-down by mistake, forcing engineers to dismantle and rebuild it over a three-year period.", "label": 0}
{"final": "Madrid’s Manzanares River once froze completely during the winter of 1942, allowing residents to skate across from the Royal Palace to the Casa de Campo.", "label": 0}
{"final": "The Palacio de Cibeles contains a hidden royal dining room preserved exactly as it appeared during King Alfonso XIII’s final banquet before exile in 1931.", "label": 0}
